tap 'homebrew/core'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mackup'
brew 'mas'

#brew 'php@7.4'
brew 'php@8.0'
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'nginx'
brew 'node'

cask '1password'
cask 'adobe-creative-cloud'
#cask 'alfred'
cask 'appcleaner'
cask 'battle-net'
cask 'brave-browser'
#cask 'cheatsheet'
cask 'cryptomator'
cask 'dbngin'
cask 'docker'
cask 'fantastical'
#cask 'fig'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'helo'
#cask 'imageoptim'
cask 'insomnia'
cask 'invoker'
#cask 'iterm2'
cask 'keka'
#cask 'keyboard-maestro'
cask 'little-snitch'
cask 'macfuse'
#cask 'netnewswire'
cask 'obsidian'
cask 'pdf-expert'
#cask 'phpstorm'
cask 'jetbrains-toolbox'
cask 'ray'
cask 'raycast'
cask 'rocket'
cask 'setapp'
cask 'spotify'
cask 'steam'
#cask 'sublime-text'
#cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tint'
cask 'transmit'
#cask 'tresorit'
cask 'visual-studio-code'
cask 'warp'

cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

#cask 'font-fira-code'
cask 'font-fira-code-nerd-font'

#mas 'Bear', id: 1091189122
#mas 'Disk Speed Test', id: 425264550
mas 'Magnet', id: 441258766
#mas 'New File Menu', id: 1064959555
#mas 'Sequel Ace', id: 1518036000
mas 'Spark', id: 1176895641
#mas 'Things', id: 904280696
mas 'Trello', id: 1278508951
#mas 'Twitter', id: 1482454543
